{
    "1": [
        {
            "Title": "Biological Foundations I",
            "Department": "Biology",
            "Code": "10100",
            "Description": "Introduction to biology, emphasizing primarily the cell and molecular levels of organization. Topics include characteristics of life, cellular organization and diversity, chemistry of life, bioenergetics, reproduction and early development, and major living groups. Students develop critical thinking and technical skills that are essential for mastering the content areas. These include: vocabulary skills, critical thinking, collaborative learning, microscopy, collection and handling of scientific data, and elements of scientific investigation.",
            "Reflection": "Learnt basic chemistry and molecular biology, labs were fun, favorite part was DNA extraction lab."
        },
        {
            "Title": "Calculus I",
            "Department": "Math",
            "Code": "20100",
            "Description": "Limits, derivatives, rules of differentiation, differentials, graph sketching, maximum and minimum problems, related rates, antidifferentiation, Riemann sums, Fundamental Theorem of Calculus, and techniques of substitution in integrals.",
            "Reflection": "Gained appreciation for differential calculus, Prof. Keino Brown was MVP, favorite part was finally being able to use the power rule instead of limits to compute a derivate of a function."
        },
        {
            "Title": "Freshman Composition",
            "Department": "English",
            "Code": "11000",
            "Description": "The longer paper, and practice in essay forms.",
            "Reflection": "Didn't really learn much but met cool people, favorite part was the colon vs. semicolon presentation I had to make, clearly was worth every second and cent."
        },
        {
            "Title": "Applications of Psychology in the Modern World",
            "Department": "Psychlogy",
            "Code": "10200",
            "Description": "An introduction to the study of human development and learning, personality and motivation, sex differences, attitudes, aggressions, interpersonal attraction, behavior in groups and work settings, abnormal behavior and its treatment. Emphasis on the ways in which psychological theory and research can be applied to individual and social problems.",
            "Reflection": "Piqued my interest in psychology, introduced my to the iClicker, when in doubt choose B for Prof. Bob, favorite part was cow eye dissection."
        },
        {
            "Title": "Foundations of Speech Communication",
            "Department": "Speech",
            "Code": "11100",
            "Description": "Basic skills in extemporaneous speaking, oral reading, small group communication, interview techniques and listening.",
            "Reflection": "Gained confidence for public speaking and learned about the different types of speeches that exist, favorite part was my volleyball demonstrational speech."
        }
    ],
    "2": [
        {
            "Title": "Biological Foundations II",
            "Department": "Biology",
            "Code": "10200",
            "Description": "Second semester of introductory biology, emphasizing organismic biology, evolution, and ecology. Topics include heredity, macro- and microevolution, structure and function of body systems, and ecology. The course features a survey of topics in lecture and in-depth study of selected topics in laboratories and workshops.",
            "Reflection": "Met some cool people, lectures were straight from the textbook, some labs involved bioinformatics which was really cool."
        },
        {
            "Title": "Writing for Engineers",
            "Department": "English",
            "Code": "21007",
            "Description": "Engage in genre analysis and multimodal composing to explore effective writing across disciplinary contexts and beyond; as well as strengthen your source use practices (including evaluating, integrating, quoting, paraphrasing, summarizing, synthesizing, analyzing, and citing sources.",
            "Reflection": "Didn't like waking up early for the class, learnt to write a proper academic essay though, favorite part was my Vision Zero essay comparing cyclist safety initiatives around the world."
        },
        {
            "Title": "Intro to Computing",
            "Department": "Computer Science",
            "Code": "10300",
            "Description": "You will learn the basics of procedural computer programming (primarily in C++). This includes an understanding of datatypes and variables, branching and looping constructs, pointers and recursion. Additionally, we will introduce some standard tools for programming, and cover the basic operation of a computer. Lastly, we introduce elementary data structures, the standard template library, and the basics of object oriented programming.",
            "Reflection": "Didn't learn much until the OOP portion of the course, favorite part was the assignments in C++, was my first time exposed to the language."
        },
        {
            "Title": "Discrete Mathematical Structures",
            "Department": "Computer Science",
            "Code": "10400",
            "Description": "Introduction to the mathematics fundamental to all phases of computer science, from the formulation of problems to the understanding of their underlying structure, to the comparative analysis of the complexity of algorithms that can be used to solve these problems. The course introduces combinatorics, first-order logic, induction, set theory, relations and functions, graphs, trees, and number theory.",
            "Reflection": "Learnt about boolean algebra and formal mathematic reasoning, favorite part was learning boolean algebra rules so I didn't have to make truth tables."
        },
        {
            "Title": "Calculus II",
            "Department": "Math",
            "Code": "20200",
            "Description": "Areas between curves; volumes of solids of revolution; integration of trigonometric, exponential and logarithmic functions, analytical and numerical methods of integration, improper and infinite integrals, conic sections, polar coordinates; parametric representation of curves.",
            "Reflection": "Learnt about intergal calculus and its applications on 2-Dimensional vectors, Prof. Paolilo was my dude, favorite part was never having to take calculus in an academic setting again."
        }
    ],
    "3": [
        {
            "Title": "Fundamentals of Computer Systems",
            "Department": "Computer Science",
            "Code": "21100",
            "Description": "Fundamentals of computer organization and digital logic. Boolean algebra, number systems and codes, combinational logic design principles, basic gates and components, flipflops and latches, counters and state machines. Assembly language and assemblers; procedures and data segments, linkages and subroutine calling conventions, loaders; practical use of an assembly language.",
            "Reflection": "Learnt about applying boolean algebra to digital circuits, favorite part were the labs where I got to toy around with a breadboard and other hardware parts."
        },
        {
            "Title": "Data Structues",
            "Department": "Computer Science",
            "Code": "21200",
            "Description": "You will learn how to design and implement basic data structures (in C/C++), how to analyze such structures and their associated algorithms for efficiency and correctness, and finally you should gain a great deal of confidence and ability in applying these structures to solve larger problems.",
            "Reflection": "Formal introduction to certain data strucutures such as linked-lists, stacks, and queues. Favorite parts were the assignments and introduction to Big-O."
        },
        {
            "Title": "Modern Programming Language",
            "Department": "Computer Science",
            "Code": "11300",
            "Description": "This course is to develop understanding and fluency of a current programming language; topics include basic programming concepts, data represen-tation, functions, control structures, error handling and exceptions, testing and debugging, type safety, classes and principles of object-oriented programming. A series of laboratory-oriented programming projects is an essential component of the course.",
            "Reflection": "Course covered python, so I literally learnt nothing, but final project was the first time using turtle, so yay I guess."
        },
        {
            "Title": "Introduction to Genetics",
            "Department": "Biology",
            "Code": "20600",
            "Description": "A thorough introduction to the principles of genetics. Using a combined cell biological and Mendelian approach, the course covers DNA organization, chromosome structure, genes and alleles, and transmission of genetic information in normal and genetically compromised organisms.",
            "Reflection": "Course in biology I had been waiting for. Favorite part was in depth look at genes, their composition, and their abnormalities."
        },
        {
            "Title": "Exploring Chemistry",
            "Department": "Chemistry",
            "Code": "11000",
            "Description": "The course will cover the basics of chemistry, as is called for by any course that is called “Exploring Chemistry”. That said, the approach will be a little different. In most such courses you would be called on to memorize a fairly large set of facts, with the connections among them sometimes a little tenuous. It is relatively rare that it is made clear that extensive experimental work is required to produce these facts. Here we will learn at least something about how science is done, what it means to know something, and how certain we can be of what we know.",
            "Reflection": "Pretty much high school chemistry in a college setting, favorite part was coloring the periodic table by metals and non-metals."
        }
    ],
    "4": [
        {
            "Title": "Introduction to Cognitive Science",
            "Department": "Cognitive Science",
            "Code": "166",
            "Description": "This course will introduce the fundamental questions, findings and methods of cognitive science. The computational approach to cognition and the notion of abstract mental representation are introduced within the interdisciplinary framework of the field. Basic knowledge of cognition, computation, evolution, symbol systems, artificial neural networks, and linguistic models are discussed.",
            "Reflection": "Put me on to the cognitive science discipline, partially why I decided to minor in it. Favorite part was Henry's slide in the Paul Cézanne presentation."
        },
        {
            "Title": "Programming Languages",
            "Department": "Computer Science",
            "Code": "344",
            "Description": "Introduction to programming language concepts including design, syntax, semantics, pragmatics, implementation, and evaluation. Presentation of one or more languages from categories including algorithmic, functional, object-oriented, logic, and concurrent programming paradigms.",
            "Reflection": "Learnt about different design decisions and constructs that go into programming language creation. Favorite parts were Clojure and BNF grammars, least favorite parts were Haskell and Prolog."
        },
        {
            "Title": "Software Engineering",
            "Department": "Computer Science",
            "Code": "380",
            "Description": "Techniques for developing large software systems are presented. Formal and semiformal languages for specification and design of software, verification, and configuration management techniques are discussed.",
            "Reflection": "Got to create a cool sign language translator for the course. Favorite part was learning about positive/negative testing and mocking, and discovering Java Spark."
        },
        {
            "Title": "Ethics and Social Policy in the Digital Age",
            "Department": "Information Science",
            "Code": "300",
            "Description": "In this course, we will explore relevant philosophical theories and apply them to decisions about individual and social problems confronting software engineers, by addressing \"knowledge of the conventions and methods of at least one of the humanities.\"",
            "Reflection": "Learnt about Aristotle, Plato, and Kant amongst others. Favorite part was debating life philosophies in class."
        },
        {
            "Title": "Introduction to Discrete Mathematics",
            "Department": "Math",
            "Code": "215",
            "Description": "A survey of discrete mathematics including informal proof techniques and mathematical induction, set theory with emphasis on functions and inverse functions, cardinality of sets, graph theory, enumeration, and discrete probability theory.",
            "Reflection": "Re-learnt boolean algebra, was the first time writing formal mathematic proofs. Favorite part was using Latex for assignments and being introduced to the \\QED."
        }
    ],
    "5": [
        {
            "Title": "Software Quality",
            "Department": "Computer Science",
            "Code": "385",
            "Description": "Software Quality is a concept that is integral to all phases of the development life cycle.  This course examines the issues that impact quality, such as functionality, usability, reliability, safety, security, maintainability, portability, efficiency, performance, and availability.",
            "Reflection": "Learnt about the software engineering v-model, as well as unit, class, and specification-based testing. Favorite part was deriving test cases from the product specification and the inspection sessions."
        },
        {
            "Title": "Software Entrepreneurship",
            "Department": "Information Science",
            "Code": "484",
            "Description": "This course integrates business and software engineering models to examine entrepreneurship in technology-based firms, in particular applying frameworks and methods to scenarios where a clear path of action is uncertain due to conflicting information.  While a focus is on software start-ups, innovation in existing technology firms will also be discussed.",
            "Reflection": "Learnt about startup's economic aspect from ideation to exit. Favorite part of the class were the case-studies on previously attempted startups."
        },
        {
            "Title": "Elementary Portuguese",
            "Department": "Portuguese",
            "Code": "101",
            "Description": "Preparation of students without previous knowledge of Portuguese in the fundamentals of conversation, reading, and composition.",
            "Reflection": "Learnt present and past form conjugations for common verbs as well as phrases. Favorite part was the professor's skits."
        },
        {
            "Title": "Contemporary Native America",
            "Department": "Native American Studies",
            "Code": "350",
            "Description": "Current issues in Indian country. The course focuses on contemporary social and political trends, and on their implications. Comparisons will be made between United States and Canadian Native communities, issues and policies.",
            "Reflection": "First time I've really seen things from a Native American perspective. Was eye-opening. Favorite part was the essay I wrote about the issues with the native american healthcare system in the USA."
        }
    ],
    "6": [
        {
            "Title": "Software Design",
            "Department": "Computer Science",
            "Code": "480",
            "Description": "This course extends and integrates design techniques commonly encountered in core Computer Science courses and electives, while also focusing on the engineering challenges of constructing complex software systems that graduates are likely to encounter in practice.",
            "Reflection": "Coolest course I got to take in undergrad. Taught me to work on large multidisciplanary teams. Learnt about different development methodologies and tools. Favorite part was bothering Xavier in class."
        },
        {
            "Title": "Web Services",
            "Department": "Computer Science",
            "Code": "435",
            "Description": "Web services enable computer applications to communicate with each other across software platform, hardware and organizational boundaries. This course covers the concepts and standards in web services such as XML Schema, SOAP, WSDL, and UDDI. It discusses proper design and implementation of web services with useful applications.",
            "Reflection": "Learnt how to design RESTful APIs and working with Java Servlets. Learnt about Spark, Grails, and DropWizard too. Favorite part was discovering Groovy, super cool language."
        },
        {
            "Title": "Cultural Anthropology",
            "Department": "Anthropology",
            "Code": "112",
            "Description": "This course is designed to introduce students to the concept of culture. Subjects range from tribal politics and economies, to the evolution of sex, love, and marriage, and the nature of religion. It emphasizes that human beings are culturally dependent beings, that cultural diversity is rooted in our struggles to preserve our ethnic, tribal, and individual identities while adapting to changing environmental circumstances.",
            "Reflection": "Learnt about the faults of ethnocentricism and the basics of partaking in anthropological fieldwork, as well as getting exposed to some exotic cultures. Favorite part was bruteforcing the online homeworks."
        },
        {
            "Title": "Cognitive Musicology",
            "Department": "Cognitive Science",
            "Code": "316",
            "Description": "This course centers on computer models of music and the musical mind which are based on theories drawn from the field of Cognitive Science. The course features musically oriented “generative symbol systems” housed in a language called Clay that is accessible on the Web. These systems serve to express assorted musicological theories in computer executable form. Thus, they serve as laboratories in which to conduct a wide variety of investigations within the realm of music cognition.",
            "Reflection": "Learnt about basic music theory, such as notes and scales, and their computational representations. Learnt about popular algorithms used for music synthesis and optimization. Favorite part was gaining appreciation for the potential in the field, as well as its psychological and physical basis."
        },
        {
            "Title": "Selected Topics: Latex",
            "Department": "Computer Science",
            "Code": "326",
            "Description": "LATEX is awesome! In the time between when hand-written papers were acceptable and when LATEX rolled in, mathematicians struggled to produce documents adorned with the symbols we need. It’s not just mathematicians who benefit from a knowledge of LATEX, either. Chemists, physicists, engineers, computer scientists, and pretty much anyone who needs professional diagrams, tables, or references will appreciate the logical simplicity and flexibility of LATEX.",
            "Reflection": "Learnt to integrate images, graphs, references into documents, as well as creating slideshows and posters with Latex. Favorite part was the resume assignment, whose markup I utilize to this day."
        }
    ],
    "7": [
        {
            "Title": "Artificial Intelligence Programming Languages",
            "Department": "Computer Science",
            "Code": "416",
            "Description": "An introduction to programming techniques in Lisp and Prolog. Topics include Lisp and Prolog syntax and semantics, basic problem solving knowledge representation, and logical inference algorithms, and an introduction to their applications in artificial intelligence.",
            "Reflection": "Learnt to think in a more FP way being forced to work in Common Lisp. Topics covered were state space problem solving, and CLOS, and genetic algorithms. Favorite part was the Knapsack problem optimization genetic algorithm I devised and implemented for my final project."
        },
        {
            "Title": "Computational Models of Cognitive Processes",
            "Department": "Computer Science",
            "Code": "366",
            "Description": "Introduction to the computational study of human and machine intelligence. Discussion of computational models, algorithms, and research in neural processing, vision, memory, learning, reasoning, and information processing.",
            "Reflection": "Learnt about historical computer models for cognitive processes such as memory, pattern recognition, chatbots, and reasoning. Favorite part was the proportional analogy model I implemented based off of E-Generalizations."
        },
        {
            "Title": "Brains, Minds and Consciousness",
            "Department": "Cognitive Science",
            "Code": "266",
            "Description": "This course introduction to neuroanatomy, neurology, evolution, genetics, brain imaging techniques, brain disorders, psychoactive substances, and the phenomenon of consciousness. All topics are contextualized within the study of the mind, assuring both a measure of course coherence and the cognitive science perspective. This course is expressly tailored to the needs of cognitive science students, but it will surely be of interest to students of linguistics, psychology, philosophy, biology and education as well.",
            "Reflection": "Learnt about the differences between Brain, Mind, and Conciousness, and philosophical questions, arguments, and solutions surrounding their definition, coupled with biological and psychological phenomena that aid in answering those questions. Favorite part was the optical illusions section."
        },
        {
            "Title": "Drugs & Behavior",
            "Department": "Psychology",
            "Code": "201",
            "Description": "This course will introduce students to the psycho-(bio)logy of drug and alcohol use. Students learn about legal and illicit substances, their common uses, differences between abuse and dependence, and available treatments. The knowledge learned in this course will prepare students to critically evaluate scientific literature in the substance use field.",
            "Reflection": "Learnt about the different classes of drugs and their historical legal statuses. Focus was surrounding healthy and appropriate drug use. Favorite part was professor's honesty in regards to \"Big Pharma.\""
        }
    ],
    "8": [
        {
            "Title": "Intermediate Spanish",
            "Department": "Spanish",
            "Code": "201",
            "Description": "Review of basic grammar and introduction of more advanced structures; intermediate level conversation, reading, and composition.",
            "Reflection": "Learnt about the appropriate use and conjugations for the subjunctive and conditional tenses. Favorite part was the short film Adios Mamá."
        },
        {
            "Title": "Data Structures & Algorithms",
            "Department": "Computer Science",
            "Code": "365",
            "Description": "The design, implementation, and analysis of data structures and algorithms for data stores, data streams, graphs, and related domains, along with their use in interactive networked applications.",
            "Reflection": "Learnt about different graph representations and associated algorithms. Learnt about B-Trees, Red-Black Trees, and approximation algorithms too. Favorite part was the image connected components labelling assignment."
        },
        {
            "Title": "Human Sexual Development",
            "Department": "Human Development",
            "Code": "313",
            "Description": "This course explores all aspects of human sexuality from biological, social and cultural perspectives within a developmental framework. Topics include sexual differentiation, anatomy, hormones and sexual behavior, lifespan sexual development, reproductive cycles, pregnancy, contraception, childbirth and parenting, gender differences, cultural sexual practices, sexually transmitted diseases, aging, and sexual dysfunction.",
            "Reflection": "Learnt about historical and cultural differences to modern sexuality. Learnt about human sexual anatomy and diseases/infections too. Favorite parts were the images."
        },
        {
            "Title": "Computer Models of Language Representation and Processing",
            "Department": "Cognitive Science",
            "Code": "376",
            "Description": "This course opens with a short review of work done within the field of Natural Language Processing. Emphasis is placed on symbolic systems, rather than connectionist systems. Network formalism for the representation and processing of language at various levels are discussed. Modern grammars and parsing techniques are presented. Models of discourse developed. Experiments on generative models of the creative use of language are designed and conducted.",
            "Reflection": "Learnt about basic NLP techiques and tools, as well as history surrounding NLU. Favorite part was the Bayesian e-mail spam filtering classifier I made for my final project."
        }
    ],
    "9": [
        {
            "Title": "European History",
            "Department": "History",
            "Code": "101",
            "Description": "This course will deal with the historical development of modern Western civilization and the interrelationship between the West and the world during the period 1500—1900.",
            "Reflection": "Learnt about major European events since the Renaissance until contemporary times, as well as art movements in that timeframe. Favorite part was memorizing the name Prince Leopold von Hohenzollern-Sigmaringen."
        },
        {
            "Title": "United States History",
            "Department": "History",
            "Code": "202",
            "Description": "This course explores the making of American society and culture the product of cooperation and conflict among peoples from three continents (Europe, Africa, and North America)’from the 1500’s to contemporary times. The focus is on economics, religion, values, community, politics, gender, and race.",
            "Reflection": "Learnt about US history at greater depth from the precolonial age to Obama's presidency. Favorite part was visiting the Tenement Museum."
        },
        {
            "Title": "Spanish Language & Culture",
            "Department": "Spanish",
            "Code": "101/102",
            "Description": "Continuation of SPA 101. Fundamentals of conversation, reading, and composition.",
            "Reflection": "Learnt a lot of advanced Spanish tenses and cultural norms/practices in different Latin American countries. Favorite part was the speaking portion of the exam."
        },
        {
            "Title": "Macroeconomics",
            "Department": "Economy",
            "Code": "200",
            "Description": "This course introduces students to economics and the central topics of macroeconomics: output determination, unemployment and inflation, money and banking, fiscal and monetary policy, international trade, exchange rates and the balance of payments.",
            "Reflection": "Learnt about national economy attributes and international trading policies. When in doubt, graph it out. Favorite part were the in-class competitive review sessions."
        },
        {
            "Title": "Physics I",
            "Department": "Physics",
            "Code": "111",
            "Description": "A course in mechanics, heat, properties of matter and wave motion. High school algebra and trigonometry required.",
            "Reflection": "Learnt about newtonian translational and rotational mechanics, as well as basic wave motion and electromagnetism concepts. Favorite part was the Kirchoff's Laws labratory session."
        }
    ]
}